app/controllers/projects_controller.rb

INSERT INTO "projects" ("name", "created_at", "updated_at", "content") VALUES('kevin', '2011-07-22 01:57:10', '2011-07-22 01:57:10', 'test')
---
  def create
    expire_page :action => :index
    expire_action :action => :index
    @project = Project.new(params[:project])

    respond_to do |format|
      if @project.save